khoih-prog/AsyncWebServer_ESP32_W5500/src/AsyncWebServer_ESP32_W5500.h
/****************************************************************************************************************************
  AsyncWebServer_ESP32_W5500.h - Dead simple Ethernet AsyncWebServer.

  For W5500 LwIP Ethernet in ESP32 (ESP32 + W5500)

  AsyncWebServer_ESP32_W5500 is a library for the LwIP Ethernet W5500 in ESP32 to run AsyncWebServer

  Based on and modified from ESPAsyncWebServer (https://github.com/me-no-dev/ESPAsyncWebServer)
  Built by Khoi Hoang https://github.com/khoih-prog/AsyncWebServer_ESP32_W5500
  Licensed under GPLv3 license

  Original author: Hristo Gochkov

  Copyright (c) 2016 Hristo Gochkov. All rights reserved.

  This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public License along with this library;
  if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

  Version: 1.6.3

  Version Modified By   Date      Comments
  ------- -----------  ---------- -----------
  1.6.2   K Hoang      30/11/2022 Initial porting for ENC28J60 + ESP32. Sync with AsyncWebServer_WT32_ETH01 v1.6.2
  1.6.3   K Hoang      05/12/2022 Add Async_WebSocketsServer, MQTT examples
 *****************************************************************************************************************************/

#ifndef _AsyncWebServer_ESP32_W5500_H_
#define _AsyncWebServer_ESP32_W5500_H_

/////////////////////////////////////////////////

#if ESP32

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using ESP32 architecture for WebServer_ESP32_W5500
  #endif

#else
  #error This code is designed for ESP32_W5500 to run on ESP32 platform! Please check your Tools->Board setting.
#endif

/////////////////////////////////////////////////

#if ( ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) ) && ( ARDUINO_ESP32_GIT_VER != 0x46d5afb1 ) )
  #define USING_CORE_ESP32_CORE_V200_PLUS      true

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v2.0.0+ in AsyncWebServer_ESP32_W5500.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_W5500_VERSION      "AsyncWebServer_ESP32_W5500 v1.6.3 for core v2.0.0+"
#else

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v1.0.6- in AsyncWebServer_ESP32_W5500.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_W5500_VERSION      "AsyncWebServer_ESP32_W5500 v1.6.3 for core v1.0.6-"
#endif

#define ASYNC_WEBSERVER_ESP32_W5500_VERSION_MAJOR     1
#define ASYNC_WEBSERVER_ESP32_W5500_VERSION_MINOR     6
#define ASYNC_WEBSERVER_ESP32_W5500_VERSION_PATCH     3

#define ASYNC_WEBSERVER_ESP32_W5500_VERSION_INT       1006003

/////////////////////////////////////////////////

#ifndef ESP32_W5500_AWS_UNUSED
  #define ESP32_W5500_AWS_UNUSED(x)       (void)(x)
#endif

/////////////////////////////////////////////////

#include "Arduino.h"

#include <functional>
#include "FS.h"

#include "StringArray.h"

//////////////////////////////////////////////////////////////
// ESP32_W5500 related code

#include "AsyncWebServer_ESP32_W5500_Debug.h"

#if 1

  #include <WiFi.h>
  #include <WebServer.h> // Introduce corresponding libraries

  #include "w5500/esp32_w5500.h"

  #include <hal/spi_types.h>

  #if !defined(ETH_SPI_HOST)
    #define ETH_SPI_HOST            SPI3_HOST
  #endif

  #if !defined(SPI_CLOCK_MHZ)
    // Using 25MHz for W5500, 14MHz for W5100
    #define SPI_CLOCK_MHZ       25
  #endif

  #if !defined(INT_GPIO)
    #define INT_GPIO            4
  #endif

  #if !defined(MISO_GPIO)
    #define MISO_GPIO           19
  #endif

  #if !defined(MOSI_GPIO)
    #define MOSI_GPIO           23
  #endif

  #if !defined(SCK_GPIO)
    #define SCK_GPIO            18
  #endif

  #if !defined(CS_GPIO)
    #define CS_GPIO             5
  #endif

  #ifndef SHIELD_TYPE
    #define SHIELD_TYPE         "ESP32_W5500"
  #endif



#else

  //#include <WebServer_ESP32_W5500.hpp>


#endif

extern bool ESP32_W5500_eth_connected;

extern void ESP32_W5500_onEvent();

extern void ESP32_W5500_waitForConnect();

extern bool ESP32_W5500_isConnected();

extern void ESP32_W5500_event(WiFiEvent_t event);

//////////////////////////////////////////////////////////////

#include <AsyncTCP.h>

#ifdef ASYNCWEBSERVER_REGEX
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE
#else
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE      __attribute__((warning("ASYNCWEBSERVER_REGEX not defined")))
#endif

#define DEBUGF(...) //Serial.printf(__VA_ARGS__)

class AsyncWebServer;
class AsyncWebServerRequest;
class AsyncWebServerResponse;
class AsyncWebHeader;
class AsyncWebParameter;
class AsyncWebRewrite;
class AsyncWebHandler;
class AsyncStaticWebHandler;
class AsyncCallbackWebHandler;
class AsyncResponseStream;

/////////////////////////////////////////////////

#ifndef WEBSERVER_H

typedef enum
{
  HTTP_GET     = 0b00000001,
  HTTP_POST    = 0b00000010,
  HTTP_DELETE  = 0b00000100,
  HTTP_PUT     = 0b00001000,
  HTTP_PATCH   = 0b00010000,
  HTTP_HEAD    = 0b00100000,
  HTTP_OPTIONS = 0b01000000,
  HTTP_ANY     = 0b01111111,
} WebRequestMethod;

#endif

//if this value is returned when asked for data, packet will not be sent and you will be asked for data again
#define RESPONSE_TRY_AGAIN      0xFFFFFFFF

typedef uint8_t WebRequestMethodComposite;
typedef std::function<void(void)> ArDisconnectHandler;

/////////////////////////////////////////////////

/*
   PARAMETER :: Chainable object to hold GET/POST and FILE parameters
 * */

class AsyncWebParameter
{
  private:
    String _name;
    String _value;
    size_t _size;
    bool _isForm;
    bool _isFile;

